
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/hawk0616/terraform-for-container-operation/actions/runs/5693444912)



<pre><code>Apply complete! Resources: 3 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-075058cf3c293747f]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0aadae0bd723083b6]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0393c7a160030dccf]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0d451342d3cfc463c]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-08ba86b00c36d4b2a]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0110bf1fc9c4088c2]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-045e7a4287d60f218]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0159c63a097a933ae]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0a3adca757c7a29b2]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0ca36752b1b4ca25b]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0ad7a27af85265202]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0c3f487829a2e1587]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0854cdc54210a818e]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-020770d2bf0cce94b]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0110bf1fc9c4088c21080289494]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-03ad33c2a0995ef02]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-094be487cdd8dc310]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0fd749b24ca4fea4b]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-047bd52bbcf806376]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-082ec01efead41866]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-03c7ba16c4f55b0a1]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0a3adca757c7a29b21080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0ad7a27af852652021080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "For ALB."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all to outbound."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTP from ALL."
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "go-for-api-alb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "go-for-api-alb"
        }
      + tags_all               = {
          + "Name" = "go-for-api-alb"
        }
      + vpc_id                 = "vpc-075058cf3c293747f"
    }

  # aws_security_group.ecs will be created
  + resource "aws_security_group" "ecs" {
      + arn                    = (known after apply)
      + description            = "For ECS."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all to outbound."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "go-for-api-ecs"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "go-for-api-ecs"
        }
      + tags_all               = {
          + "Name" = "go-for-api-ecs"
        }
      + vpc_id                 = "vpc-075058cf3c293747f"
    }

  # aws_security_group_rule.ecs_from_alb will be created
  + resource "aws_security_group_rule" "ecs_from_alb" {
      + description              = "Allow 8080 from Security Group for ALB."
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
aws_security_group.ecs: Creating...
aws_security_group.alb: Creating...
aws_security_group.ecs: Creation complete after 4s [id=sg-0ac74d3a206d70d04]
aws_security_group.alb: Creation complete after 4s [id=sg-0302e3d2b024b00f0]
aws_security_group_rule.ecs_from_alb: Creating...
aws_security_group_rule.ecs_from_alb: Creation complete after 1s [id=sgrule-586569237]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":5,"Program":"tfcmt","SHA1":"101361435e3a209450f2edd8c8cc41c870934098","Vars":{},"WorkflowName":"Terraform"} -->